Marco-42/RedPill-T/satellite/stm32/src/stm32_fun.cpp
// Functions and libraries
#include "stm32_fun.h"


// ---------------------------------
// PRINT FUNCTIONS
// ---------------------------------


// Print boot message on serial
void printStartupMessage(const char* device)
{
	vTaskDelay(500);
	Serial.print(device);
	Serial.print(" starting ... ");
	vTaskDelay(100);
	// Serial.println("ok");
	// Serial.println("");
	// vTaskDelay(100);
}

// Print radio status on serial
void printRadioStatus(int8_t state, bool blocking)
{

	// No error reported
	if (state == RADIOLIB_ERR_NONE)
	{
		// Serial.println("ok");
	}
	else
	{
		Serial.println((String) "failed! --> Code: " + state);
		if (blocking)
		{
			Serial.println("Blocking program until user forces restart!");
			while (true)
			{
				delay(10000);
				Serial.println("Program blocked, please restart ...");
			}
		}
	}
}

// Print received data on serial with optional prefix
void printData(const char* prefix, const uint8_t* data, uint8_t length)
{
    if (prefix != nullptr)
    {
        Serial.print(prefix);
    }
	
	for (uint8_t i = 0; i < length; ++i)
	{
		Serial.printf("%02X ", data[i]);
	}
	Serial.println();
}

// Print packet on serial with optional prefix
void printPacket(const char* prefix, const Packet* packet)
{
	if (prefix != nullptr) {
		Serial.print(prefix);
	}
	Serial.printf("%02X ", packet->station);
	Serial.printf("%02X ", packet->ecc ? RS_ON : RS_OFF);
	Serial.printf("%02X ", packet->command);
	Serial.printf("%02X ", packet->payload_length);
	// Print time_unix as 4 bytes, each as two hex digits, space-separated
	for (int i = 0; i < 4; ++i) {
		Serial.printf("%02X ", (packet->time_unix >> (8 * (3 - i))) & 0xFF);
	}
	// Print MAC as 4 bytes, each as two hex digits, space-separated
	for (int i = 0; i < 4; ++i) {
		Serial.printf("%02X ", (packet->MAC >> (8 * (3 - i))) & 0xFF);
	}
	for (uint8_t i = 0; i < packet->payload_length; ++i) {
		Serial.printf("%02X ", packet->payload[i]);
	}
	Serial.println();
}


// ---------------------------------
// HELPER FUNCTIONS
// ---------------------------------

// Global Objects
STM32RTC& rtc = STM32RTC::getInstance(); // L496 Internal RTC

// Initialize system time to a specific UNIX timestamp, or default to Jan 1, 2025 if 0
void setUNIX(uint32_t unixTime)
{
    if (!rtc.isTimeSet())
{
        rtc.begin(); // Selects LSE (External 32k Crystal) automatically if available
    }

    if (unixTime == 0)
{
        // Default to Jan 1, 2025
        rtc.setEpoch(1735689600);
    }
	else
	{
        rtc.setEpoch(unixTime);
    }
}

// Get current UNIX time
uint32_t getUNIX()
{
	return rtc.getEpoch();
}

// MAC function to generate a message authentication code
int8_t makeMAC(const Packet* packet, uint32_t* out_mac)
{
    // 1. Create a local HMAC object
    SHA256 hmac;
    hmac.resetHMAC(SECRET_KEY, sizeof(SECRET_KEY));

    // 2. Prepare Header Data
    uint8_t header[PACKET_HEADER_LENGTH];
    header[0] = packet->station;
    header[1] = packet->ecc ? RS_ON : RS_OFF;
    header[2] = packet->command;
    header[3] = packet->payload_length;
    header[4] = (packet->time_unix >> 24) & 0xFF;
    header[5] = (packet->time_unix >> 16) & 0xFF;
    header[6] = (packet->time_unix >> 8)  & 0xFF;
    header[7] = (packet->time_unix)       & 0xFF;
    header[8] = 0; // MAC placeholder
    header[9] = 0;
    header[10] = 0;
    header[11] = 0;
    
    // Feed Header Data
    hmac.update(header, sizeof(header));

    // 3. Feed Payload Data (if any)
    if (packet->payload_length > 0) {
        hmac.update(packet->payload, packet->payload_length);
    }

    // 4. Finalize HMAC
    uint8_t hash[32];
    hmac.finalizeHMAC(SECRET_KEY, sizeof(SECRET_KEY), hash, sizeof(hash));

    // 5. Truncate to 4 bytes (Big Endian)
    *out_mac = ((uint32_t)hash[0] << 24) |
               ((uint32_t)hash[1] << 16) |
               ((uint32_t)hash[2] << 8)  |
               ((uint32_t)hash[3]);

    return PACKET_ERR_NONE;
}

// Write float as 4 byte big endian
void writeFloatToBytes(float value, uint8_t* buffer)
{
	uint32_t value_int;
	memcpy(&value_int, &value, sizeof(float));  // interpret float bits as uint32_t

	buffer[0] = (value_int >> 24) & 0xFF;
	buffer[1] = (value_int >> 16) & 0xFF;
	buffer[2] = (value_int >> 8) & 0xFF;
	buffer[3] = value_int & 0xFF;
}


// ---------------------------------
// RADIO FUNCTIONS
// ---------------------------------

// Notify COMMS task of a radio event (called when packet sent or received)
void packetEvent(void)
{
	// Define task to be notified
	BaseType_t higher_priority_task_woken = pdFALSE;
	TaskHandle_t task_to_notify = RTOS_handle_COMMS_StateMachine; // always notify COMMS task

	// Notify task
	vTaskNotifyGiveFromISR(task_to_notify, &higher_priority_task_woken); // notify task
	portYIELD_FROM_ISR(higher_priority_task_woken);
}

// Start LoRa reception
void startReception(void)
{
	// Start listening
	// Serial.print("Listening ... ");
	int8_t rx_state = radio.startReceive();

	// Report listening status
	printRadioStatus(rx_state);
}

// Start LoRa transmission
void startTransmission(uint8_t* tx_packet, uint8_t packet_size)
{
	// Start transmission
	printData("Transmitting: ", tx_packet, packet_size);
	int8_t tx_state = radio.startTransmit(tx_packet, packet_size);
	
	// Report transmission status
	printRadioStatus(tx_state);
}


// ---------------------------------
// PACKET FUNCTIONS
// ---------------------------------

// Initialize packet with default values
void Packet::init(bool rs_enabled, uint8_t cmd)
{
	state = PACKET_ERR_NONE; // no error
	station = MISSION_ID; // default station ID
	command = cmd; // set command type
	
	if (rs_enabled)
	{
		switch (command)
		{
			case TER_BEACON:
				ecc = false; // disable RS encoding only for TER_BEACON
				break;
			default:
				ecc = true; // enable RS encoding for all other commands
				break;
		}
	}
	else
	{
		ecc = false; // disable RS encoding by default
	}

	time_unix = 0; // default UNIX time
	MAC = 0; // default MAC

	payload_length = 0; // no payload by default
	memset(payload, 0, PACKET_PAYLOAD_MAX); // clear payload
}

