Marco-42/RedPill-T/satellite/stm32/src/stm32_fun.cpp
// Set packet payload data and length
int8_t Packet::setPayload(const uint8_t* data, uint8_t length)
{
	if (length > PACKET_PAYLOAD_MAX)
	{
		return PACKET_ERR_LENGTH;
	}

	memcpy(payload, data, length);
	payload_length = length;

	return PACKET_ERR_NONE;
}

// Seal packet by calculating MAC and setting time
int8_t Packet::seal()
{
	time_unix = getUNIX();

	uint32_t mac_calculated;
	int8_t mac_state = makeMAC(this, &mac_calculated);

	if (mac_state != PACKET_ERR_NONE)
		return mac_state;

	MAC = mac_calculated;
	return PACKET_ERR_NONE;
}

// Convert received data to packet with validation
void dataToPacket(const uint8_t* data, uint8_t length, Packet* packet)
{
	// Check if data size can be decoded
	if (length < PACKET_HEADER_LENGTH || length > PACKET_SIZE_MAX)
	{
		packet->state = PACKET_ERR_LENGTH; // Invalid packet length
		return; 
	}

	// Byte 0: station ID
	packet->station = data[0];

	// Byte 1: RS flag
	if (data[1] == RS_ON)
	{
		packet->ecc = true;
	}
	else if (data[1] == RS_OFF)
	{
		packet->ecc = false;
	}
	else
	{
		packet->state = PACKET_ERR_RS; // invalid RS flag
		return;
	}

	// Byte 2: command (TEC type + Task value)
	packet->command = data[2];
	
	if (!isTEC(packet->command)) // Check if command is a valid TEC
	{
		packet->state = PACKET_ERR_CMD_UNKNOWN; // unknown command
		return;
	}

	// Byte 3: Payload length
	packet->payload_length = data[3];

	// Remove padding bytes
	if (length > PACKET_HEADER_LENGTH + packet->payload_length)
	{
		// Remove all trailing padding bytes
		while (length > PACKET_HEADER_LENGTH + packet->payload_length)
		{
			if (data[length - 1] == RS_PADDING) // Check if last byte is padding
			{
				// Remove padding byte
				length--;
			}
			else
			{
				// A padding byte was expected but not found
				packet->state = PACKET_ERR_LENGTH; // Invalid packet length
				return;
			}
		}
	}

	if (packet->payload_length > PACKET_PAYLOAD_MAX || length != PACKET_HEADER_LENGTH + packet->payload_length)
	{
		packet->state = PACKET_ERR_LENGTH; // invalid payload length
		return;
	}

	// Byte 4–7: UNIX time
	packet->time_unix = ((uint32_t)data[4] << 24) | ((uint32_t)data[5] << 16) | ((uint32_t)data[6] << 8) | (uint32_t)data[7];

	// Byte 8–11: MAC
	packet->MAC = ((uint32_t)data[8] << 24) | ((uint32_t)data[9] << 16) | ((uint32_t)data[10] << 8) | (uint32_t)data[11];

	// Parse payload
	packet->setPayload(data + PACKET_HEADER_LENGTH, packet->payload_length);

	// Check if MAC is valid
	uint32_t mac_calculated;
	int8_t mac_state = makeMAC(packet, &mac_calculated);

	if (mac_state != PACKET_ERR_NONE)
	{
		packet->state = mac_state; // MAC error
		return;
	}
	if (mac_calculated == packet->MAC)
	{
		packet->mac_valid = true; // MAC valid
	}
	else
	{
		packet->mac_valid = false; // MAC invalid
	}
	// No PACKET_ERR_MAC here to allow processing packets with invalid MAC if it is not required (radiomateur payload)

	// Serial.printf("Packet MAC: %08X, Calculated MAC: %08X\n", packet->MAC, mac_calculated);

	// Packet successfully decoded
	packet->state = PACKET_ERR_NONE;
}

// Convert struct to packet to be sent, return length
uint8_t packetToData(const Packet* packet, uint8_t* data)
{
	// Byte 0: station ID
	data[0] = packet->station;

	// Byte 1: RS encoding flag
	if (packet->ecc)
	{
		data[1] = RS_ON; // RS encoding on
	}
	else
	{
		data[1] = RS_OFF; // RS encoding off
	}

	// Byte 2: command
	data[2] = packet->command;

	// Byte 3: payload length
	data[3] = packet->payload_length;

	// Byte 4–7: UNIX time
	data[4] = (packet->time_unix >> 24) & 0xFF;
	data[5] = (packet->time_unix >> 16) & 0xFF;
	data[6] = (packet->time_unix >> 8) & 0xFF;
	data[7] = packet->time_unix & 0xFF;

	// Byte 8–11: MAC
	data[8] = (packet->MAC >> 24) & 0xFF;
	data[9] = (packet->MAC >> 16) & 0xFF;
	data[10] = (packet->MAC >> 8) & 0xFF;
	data[11] = packet->MAC & 0xFF;

	// Payload bytes
	for (uint8_t i = 0; i < packet->payload_length; i++)
	{
		data[PACKET_HEADER_LENGTH + i] = packet->payload[i];
	}

	// Return total length of data
	return PACKET_HEADER_LENGTH + packet->payload_length;
}


// ---------------------------------
// ECC FUNCTIONS
// ---------------------------------

// Check if RS ECC is enabled in the packet
bool isDataECCEnabled(const uint8_t* data, uint8_t length)
{
	// Check if RS ECC is enabled in the packet
	if ((length % RS_BLOCK_SIZE == 0) && (data[1] != RS_OFF))
	{
		// If the data length is a multiple of RS_BLOCK_SIZE and RS ECC is not disabled, we can infer ECC is enabled
		return true;
	}
	return false;
}

// Encode data using RS ECC and interleave the output
void encodeECC(uint8_t* data, uint8_t& data_len)
{
	uint8_t num_blocks = (data_len + DATA_BLOCK_SIZE - 1) / DATA_BLOCK_SIZE;

	// Temporary storage for codewords before interleaving
	uint8_t codewords[num_blocks][RS_BLOCK_SIZE];

	// Encode each block with padding as needed
	for (uint8_t i = 0; i < num_blocks; ++i)
	{
		uint8_t block[DATA_BLOCK_SIZE] = {RS_PADDING}; // Initialize with padding byte
		uint8_t remaining = data_len - i * DATA_BLOCK_SIZE;
		uint8_t copy_len = remaining >= DATA_BLOCK_SIZE ? DATA_BLOCK_SIZE : remaining;

		memcpy(block, data + i * DATA_BLOCK_SIZE, copy_len);
		encode_data(block, DATA_BLOCK_SIZE, codewords[i]);
	}

	// Interleave column-wise into a temporary buffer
	uint8_t interleaved[num_blocks * RS_BLOCK_SIZE];
	for (uint8_t col = 0; col < RS_BLOCK_SIZE; ++col) {
		for (uint8_t row = 0; row < num_blocks; ++row) {
			interleaved[col * num_blocks + row] = codewords[row][col];
		}
	}

	// Copy interleaved codewords back to original data buffer
	memcpy(data, interleaved, num_blocks * RS_BLOCK_SIZE);

	// Update data length to encoded size (with parity)
	data_len = num_blocks * RS_BLOCK_SIZE;
}

// Decode data by deinterleaving and correcting errors
int8_t decodeECC(uint8_t* data, uint8_t& data_len)
{
	int8_t error = PACKET_ERR_NONE;
	uint8_t num_blocks = data_len / RS_BLOCK_SIZE;

	// Temporary storage for deinterleaved codewords
	uint8_t codewords[num_blocks][RS_BLOCK_SIZE];

	// Deinterleave: undo column-wise interleaving
	for (uint8_t col = 0; col < RS_BLOCK_SIZE; ++col)
	{
		for (uint8_t row = 0; row < num_blocks; ++row)
		{
			codewords[row][col] = data[col * num_blocks + row];
		}
	}

	// Decode each codeword and write back only the data portion (without parity) in-place into data buffer
	uint8_t write_pos = 0;
	for (uint8_t i = 0; i < num_blocks; ++i)
	{
		uint8_t decoded[RS_BLOCK_SIZE] = {0};

		// decode_data takes encoded codeword and outputs decoded codeword (data + parity)
		decode_data(codewords[i], RS_BLOCK_SIZE);

