Marco-42/RedPill-T/satellite/stm32/src/stm32_fun.cpp
		if (check_syndrome() != 0)
		{
			int8_t result = correct_errors_erasures(codewords[i], RS_BLOCK_SIZE, 0, nullptr);
			if (result == 0)
			{
				Serial.printf("RS decode failed on block %d\n", i);
				error = PACKET_ERR_DECODE; // set error code for RS decode failure
			}
			else
			{
				Serial.printf("RS decode corrected errors in block %d\n", i);
			}
		}
		// Copy only the data bytes (without parity) back to the original data buffer
		memcpy(data + write_pos, codewords[i], DATA_BLOCK_SIZE);
		write_pos += DATA_BLOCK_SIZE;
	}

	// Update data_len to new decoded length (without parity)
	data_len = num_blocks * DATA_BLOCK_SIZE;

	return error; // return error code
}


// ---------------------------------
// COMMAND FUNCTIONS
// ---------------------------------

// Execute TEC from valid packets
int8_t executeTEC(const Packet* cmd)
{
	if (cmd == nullptr)
	{
		return PACKET_ERR_CMD_POINTER;
	}

	// Execute (assumes payloads are correct!)
	switch (cmd->command)
	{
		case TEC_OBC_REBOOT:
			Serial.println("TEC: OBC_REBOOT");
			NVIC_SystemReset();
			break;

		case TEC_EXIT_STATE:
			Serial.println("TEC: EXIT_STATE");
			break;

		case TEC_VAR_CHANGE:
			Serial.println("TEC: VAR_CHANGE");
			break;

		case TEC_SET_TIME:
		{
			Serial.println("TEC: SET_TIME");

			uint32_t time_new = ((uint32_t)cmd->payload[0] << 24) | ((uint32_t)cmd->payload[1] << 16) | ((uint32_t)cmd->payload[2] << 8) | (uint32_t)cmd->payload[3];
			setUNIX(time_new);
			Serial.printf("Time set to: %u\n", time_new);
			break;
		}

		case TEC_EPS_REBOOT:
			Serial.println("TEC: EPS_REBOOT");
			break;

		case TEC_ADCS_REBOOT:
			Serial.println("TEC: ADCS_REBOOT");
			break;

		case TEC_ADCS_TLE:
			Serial.println("TEC: ADCS_TLE");
			break;
		
		case TEC_LORA_STATE:
		{
			Serial.println("TEC: LORA_STATE");

			// Unpack LoRa state from payload
			uint8_t tx_state_new = cmd->payload[0];
			uint8_t val0 = (tx_state_new >> 0) & 0b1111;
			uint8_t val1 = (tx_state_new >> 4) & 0b1111;
			Serial.printf("LoRa TX State new: %d, values: %d, %d\n", tx_state_new, val0, val1);

			// Check if both nibbles are the same
			if (val0 != val1)
			{
				Serial.println("LoRa TX State values are not all the same!");
				return PACKET_ERR_CMD_PAYLOAD;
			}
			tx_state_new = val0;

			// Unpack duration from payload
			uint32_t duration = ((uint32_t)cmd->payload[1] << 16) | ((uint32_t)cmd->payload[2] << 8) | (uint32_t)cmd->payload[3];

			// Set LoRa TX state
			tx_state = tx_state_new;
			Serial.printf("LoRa TX State set to %d for %d s\n", tx_state, duration);

			// Cancel previous timer if still active
			deleteTimerIfExists(&RTOS_timer_lora_state, "LoRa State Timer");
			
			// Schedule delayed revert if needed
			if (duration > 0)
			{
				// Create packet with no delay to trigger the state change when timer expires
				createDelayedCommand(cmd,
							queueDelayedPacket,
							duration,
							editDelayedLoraState,
							&RTOS_timer_lora_state,
							"LoRa State Timer");
			}
			else
			{
				// Permanent state, nothing else to do
			}
			break;
		}

		case TEC_LORA_CONFIG:
		{
			Serial.println("TEC: LORA_CONFIG");

			// Byte 0–2: frequency in MHz
			uint32_t freq_mhz = (((uint32_t)cmd->payload[0] << 16) |
								((uint32_t)cmd->payload[1] << 8) |
								(uint32_t)cmd->payload[2]) / 1000;

			// Byte 3
			uint8_t b3 = cmd->payload[3];
			uint8_t bandwidth = (b3 >> 6) & 0b11; // 2 bits
			float bw_khz = 0.0;
			switch (bandwidth)
			{
			case 0:
				bw_khz = 62.5;
				break;
			case 1:
				bw_khz = 125.0;
				break;
			case 2:
				bw_khz = 250.0;
				break;
			case 3:
				bw_khz = 500.0;
				break;
			}
			uint8_t sf = ((b3 >> 3) & 0b111) + 6; // 3 bits, add 6
			uint8_t cr = (b3 & 0b111) + 5; // 3 bits, add 5

			// Byte 4
			uint8_t b4 = cmd->payload[4];
			int8_t power = ((b4 >> 3) & 0b11111) - 9; // 5 bits
			uint8_t reserved = b4 & 0b111; // 3 bits

			// Byte 5: duration in seconds
			uint8_t duration = cmd->payload[5];

			// Validate parameters
			Serial.printf("LoRa Config: Freq: %u kHz, BW: %.1f kHz, SF: %d, CR: %d, Power: %d dBm\n", freq_mhz, bw_khz, sf, cr, power);
			if (freq_mhz < 400 || freq_mhz > 500 || bw_khz < 62.5 || bw_khz > 500 ||
				sf < 6 || sf > 12 || cr < 5 || cr > 8 || power < -4 || power > 17) // TODO update power range for SX1268, -9 to +22 dBm
			{
				Serial.println("Invalid LoRa configuration parameters!");
				return PACKET_ERR_CMD_PAYLOAD; // payload error
			}

			// Apply LoRa configuration
			int8_t state = radio.setFrequency(freq_mhz);
			state = state + radio.setBandwidth(bw_khz);
			state = state + radio.setSpreadingFactor(sf);
			state = state + radio.setCodingRate(cr);
			state = state + radio.setOutputPower(power);
			if (state != RADIOLIB_ERR_NONE)
			{
				return PACKET_ERR_CMD_PAYLOAD; // payload error
			}

			// Cancel previous timer if still active
			deleteTimerIfExists(&RTOS_timer_lora_config, "LoRa Config Timer");

			// Handle duration-based reset
			if (duration > 0)
			{
				// Create packet with no delay to trigger the state change when timer expires
				createDelayedCommand(cmd,
							queueDelayedPacket,
							duration,
							editDelayedLoraConfig,
							&RTOS_timer_lora_config,
							"LoRa Config Timer");
			}
			else
			{
				// Permanent state, nothing else to do
			}
			break;
		}

		case TEC_LORA_PING:
		{
			Serial.println("TEC: LORA_LINK");

			float RSSI = radio.getRSSI();
			float SNR = radio.getSNR();
			float freq_shift = radio.getFrequencyError();

			uint8_t payload[12]; // 12 bytes for RSSI, SNR, and frequency shift
			writeFloatToBytes(RSSI, payload); // first 4 bytes for RSSI
			writeFloatToBytes(SNR, payload + 4); // next 4 bytes for SNR
			writeFloatToBytes(freq_shift, payload + 8); // last 4 bytes for frequency shift

			// Create packet with LoRa link status
			Packet lora_packet;
			lora_packet.init(rs_enabled, TER_LORA_PONG); // initialize packet
			lora_packet.setPayload(payload, sizeof(payload)); // set payload to LoRa link status
			lora_packet.seal(); // seal packet with current time and MAC

			// Send packet to queue
			xQueueSend(RTOS_queue_TX, &lora_packet, 0);
			break;
		}

		case TEC_CRY_EXP:
		{
			Serial.println("TEC: CRY_EXP");

			// First 3 bytes: glass state (6 bits) + activation delay (18 bits)
			uint32_t glass_and_delay =
				((uint32_t)cmd->payload[0] << 16) |
				((uint32_t)cmd->payload[1] << 8) |
				((uint32_t)cmd->payload[2]);

			uint8_t glass_bits = (glass_and_delay >> 18) & 0b111111;
			uint32_t activation_delay = glass_and_delay & 0x3FFFF;  // 18 bits

