Marco-42/RedPill-T/satellite/stm32/src/stm32_fun.cpp
    memcpy(delayed_cmd, cmd, sizeof(Packet));
    editDelayedCommand(delayed_cmd); // Call the specific packet editor for this TEC command
    printPacket("Packet after editing: ", delayed_cmd);

    TimerPayload* payload = (TimerPayload*)pvPortMalloc(sizeof(TimerPayload));
    if (payload == nullptr)
    {
        Serial.println("Failed to allocate timer payload");
        vPortFree(delayed_cmd);
        // return NULL;
    }

    payload->packet = delayed_cmd;
    payload->global_handle = global_timer_handle;

    TickType_t ticks = pdMS_TO_TICKS(delay_seconds * 1000UL);

    *global_timer_handle = xTimerCreate(timer_name,
                                        ticks,
                                        pdFALSE,
                                        (void*)payload,
                                        callback);

    if (*global_timer_handle != NULL)
    {
        xTimerStart(*global_timer_handle, 0);
    }
    else
    {
        vPortFree(delayed_cmd);
        vPortFree(payload);
        Serial.println("Failed to create timer");
    }

	// return *global_timer_handle;
}

// Delete timer if active
void deleteTimerIfExists(TimerHandle_t* timer_handle, const char* timer_name)
{
	if (*timer_handle != NULL)
	{
		xTimerStop(*timer_handle, 0);

		TimerPayload* payload = (TimerPayload*)pvTimerGetTimerID(*timer_handle);
		if (payload != nullptr)
		{
			if (payload->packet != nullptr)
			{
				vPortFree(payload->packet);
			}
			vPortFree(payload);
		}

		xTimerDelete(*timer_handle, 0);
		*timer_handle = NULL;

		Serial.printf("Cancelled previous %s timer\n", timer_name);
	}
}

// Edit function to set delay to 0 (generic 4-byte delay at payload[0..3])
void editDelayedGeneric4(Packet* packet)
{
	if (packet != nullptr)
	{
		// Set the first 4 bytes of the payload to 0
		memset(packet->payload, 0, 4);

		// Re-seal the packet to update MAC
		packet->seal();
	}
}

// Edit function to set delay to 0 (generic 1-byte delay at payload[0])
void editDelayedGeneric1(Packet* packet)
{
	if (packet != nullptr)
	{
		// Set the first byte of the payload to 0
		packet->payload[0] = 0;

		// Re-seal the packet to update MAC
		packet->seal();
	}
}

// Edit function to set LoRa default state with 0 delay (3-byte duration at payload[1..3])
void editDelayedLoraState(Packet* packet)
{
	 if (packet == nullptr)
    {
        Serial.println("editDelayedPacketLoraState: null packet pointer");
        return;
    }

	// Set default state and delay to 0 in payload
	printPacket("Packet before editing: ", packet);

	packet->payload[0] = ((TX_ON & 0b1111) << 4) | (TX_ON & 0b1111);
	packet->payload[1] = 0x00;
	packet->payload[2] = 0x00;
	packet->payload[3] = 0x00;

	packet->seal(); // seal the packet

	printPacket("Packet after editing: ", packet);
}

// Edit function to set LoRa default config with 0 duration (1-byte duration at payload[5])
void editDelayedLoraConfig(Packet* packet)
{
	if (packet == nullptr)
	{
		Serial.println("editDelayedLoraConfig: null packet pointer");
		return;
	}

	// Set default global values for F, BW, SF, CR, OUTPUT_POWER with 0 delay
	printPacket("Packet before editing: ", packet);

	uint32_t freq_khz = F * 1000;
	uint32_t bw_hz = BW * 1000;
	uint8_t bandwidth_code = 1; // default to 125 kHz
	switch (bw_hz)
	{
		case 62500:
			bandwidth_code = 0;
			break;
		case 125000:
			bandwidth_code = 1;
			break;
		case 250000:
			bandwidth_code = 2;
			break;
		case 500000:
			bandwidth_code = 3;
			break;
	}

	uint8_t reserved = 0b000; // reserved bits set to 0
	packet->payload[0] = (freq_khz >> 16) & 0xFF;
	packet->payload[1] = (freq_khz >> 8) & 0xFF;
	packet->payload[2] = freq_khz & 0xFF;
	packet->payload[3] = (bandwidth_code << 6) | ((SF - 6) << 3) | (CR - 5); // 2 bits BW, 3 bits SF, 3 bits CR
	packet->payload[4] = ((OUTPUT_POWER + 9) << 3) | reserved; // 5 bits power, 3 bits reserved
	packet->payload[5] = 0x00; // duration in seconds

	packet->seal(); // seal the packet

	printPacket("Packet after editing: ", packet);	
}